In [1]:
import os
import re
import pandas as pd
import sqlparse

In [26]:
def read_file(file_path):
    allselectstatements=[]
    with open(file_path, 'r') as f:
        x=f.read()
        alllines=x.split("(0.000)")
        for line in alllines:
            allselectstatements.append(line.strip())
    return allselectstatements

nlist = read_file("E:\Projects\IDS Proj\indexingProj\debug.log")
select_queries = [x for x in nlist if x.startswith("SELECT")]

In [27]:
table_name = ''
where_clause = ''

query_number_list = []
table_name_list = []
column_name_list = []
where_clauses_list = []



for (j, query) in enumerate(select_queries):
    token_list = sqlparse.parse(sqlparse.split(query)[0])[0].tokens
    
    for (i,v) in enumerate(token_list):
        if v.ttype==sqlparse.tokens.Keyword and v.value=="FROM":
            table_name = token_list[i+2].value
            table_name = table_name.strip('\"')

        if table_name != '' and table_name.startswith("logSQL"):
            if v.value.startswith("WHERE"):
                where_clause = v.value.split(";")[0]
                clauses = where_clause.strip("WHERE").strip(' ').split("AND")
                column_name = ''
                for clause in clauses:
                    try:
                        column_name = clause.split(table_name)[1].split('.')[1].split('"')[1]
                        query_number_list.append(j)
                        table_name_list.append(table_name)
                        column_name_list.append(column_name)
                        where_clauses_list.append(where_clause)
                    except:
                        pass

In [28]:
d = {
    'query_no':query_number_list,
    'table_name':table_name_list,
    'column_name':column_name_list,
    'where_clause':where_clauses_list
}

df = pd.DataFrame(data=d)

df

,query_no,table_name,column_name,where_clause
0,6,logSQL_student,age,"WHERE ""logSQL_student"".""age"" > 20"
1,7,logSQL_student,age,"WHERE ""logSQL_student"".""age"" > 20"
2,10,logSQL_student,age,"WHERE ""logSQL_student"".""age"" > 20"
3,13,logSQL_student,age,"WHERE ""logSQL_student"".""age"" > 20"
4,19,logSQL_student,age,"WHERE ""logSQL_student"".""age"" >= 21"
5,23,logSQL_student,age,"WHERE (""logSQL_student"".""age"" >= 21 AND ""logSQ..."
6,23,logSQL_student,name,"WHERE (""logSQL_student"".""age"" >= 21 AND ""logSQ..."
7,67,logSQL_faculty,subject,"WHERE ""logSQL_faculty"".""subject"" = 'Intelligen..."
8,72,logSQL_faculty,subject,"WHERE ""logSQL_faculty"".""subject"" = 'Intelligen..."

In [35]:
for i in df.size:
    print(df.iloc[i]["table_name"])

TypeError: 'numpy.int32' object is not iterable